{
   "gb":{
      "_name": "gb",
      "_description": " 8-bit handheld game console developed and manufactured by Nintendo. The first handheld in the Game Boy family. It was designed by the same team that developed the Game & Watch series of handheld electronic games and several Nintendo Entertainment System games: Satoru Okada, Gunpei Yokoi, and Nintendo Research & Development 1.",
      "_folder": "gb",
      "_full_name": "Game Boy",
      "_developer": "Nintendo R&D1",
      "_release": "28.09.1990",
      "_extensions": "gb,bin,gbz,zip",
      "_man_edit": false
   },
   "gbc":{
      "_name": "gbc",
      "_description": "handheld game console, manufactured by Nintendo. It is the successor to the Game Boy and is part of the Game Boy product line.",
      "_folder": "gbc",
      "_full_name": "Game Boy Color",
      "_developer": "Nintendo Research & Engineering",
      "_release": "23.11.1998",
      "_extensions": "cgb,bin,gbc,gbz,zip",
      "_man_edit": false
   },
   "gba":{
      "_name": "gba",
      "_description": "32-bit handheld game console developed, manufactured and marketed by Nintendo as the successor to the Game Boy Color. The GBA is part of the sixth generation of video game consoles. The original model does not have an illuminated screen; Nintendo addressed that with the release of a redesigned model with a frontlit screen, the Game Boy Advance SP, in 2003. A newer revision of the redesign was released in 2005, with a backlit screen. Around the same time, the final redesign, the Game Boy Micro, was released in September 2005.",
      "_folder": "gba",
      "_full_name": "Game Boy Advance",
      "_developer": "Nintendo R&E",
      "_release": "22.06.2001",
      "_extensions": "agb,bin,gba,gbz,zip",
      "_man_edit": false
   },
   "nes":{
      "_name": "nes",
      "_description": "8-bit third-generation home video game console produced by Nintendo. It was first released in Japan in 1983 as the Family Computer (FC), commonly known as the Famicom. The NES, a redesigned version, was released in American test markets in October 1985, before becoming widely available in the rest of North America and other countries.",
      "_folder": "nes",
      "_full_name": "Nintendo Entertainment System",
      "_developer": "Nintendo R&D2",
      "_release": "01.09.1986",
      "_extensions": "bin,fds,nes,nsf,qd,rom,unf,unif,zip",
      "_man_edit": false
   },
   "snes":{
      "_name": "snes",
      "_description": "16-bit home video game console developed by Nintendo. In Japan, it is called the Super Famicom (SFC). In South Korea, it is called the Super Comboy and was distributed by Hyundai Electronics. Although each version is essentially the same, several forms of regional lockout prevent cartridges for one version from being used in other versions.",
      "_folder": "snes",
      "_full_name": "Super Nintendo Entertainment System",
      "_developer": "Nintendo R&D2",
      "_release": "11.06.1992",
      "_extensions": "bml,bs,bsx,dx2,fig,gd3,gd7,rom,sfc,smc,st,swc,zip",
      "_man_edit": false
   },
   "n64":{
      "_name": "n64",
      "_description": "home video game console developed by Nintendo. The successor to the Super Nintendo Entertainment System. It was the last major home console to use cartridges as its primary storage format until the Nintendo Switch in 2017. As a fifth-generation console, it competed primarily with the Sony PlayStation and the Sega Saturn.",
      "_folder": "n64",
      "_full_name": "Nintendo 64",
      "_developer": "Nintendo IRD",
      "_release": "01.03.1997",
      "_extensions": "bin,n64,ndd,u1,v64,z64,zip",
      "_man_edit": false
   },
   "gamecube":{
      "_name": "gamecube",
      "_description": "home video game console developed and released by Nintendo.  It is the successor to the Nintendo 64, which released in 1996, and predecessor of the Wii, which released in 2006. As Nintendo's entry in the sixth generation of video game consoles, the GameCube competed with Sony's PlayStation 2 and Microsoft's Xbox.",
      "_folder": "gamecube",
      "_full_name": "Nintendo GameCube",
      "_developer": "Nintendo",
      "_release": "03.05.2002",
      "_extensions": "ciso,cso,gcm,gcz,iso,m3u,rvz,tgc,zip",
      "_man_edit": false
   },
   "psx":{
      "_name": "psx",
      "_description": "Home video game console developed and marketed by Sony Computer Entertainment. As a fifth-generation console, the PlayStation primarily contended with the Nintendo 64 and the Sega Saturn.",
      "_folder": "psx",
      "_full_name": "Sony PlayStation",
      "_developer": "Sony Computer Entertainment",
      "_release": "29.09.1995",
      "_extensions": "bin,cbn,ccd,chd,cue,ecm,exe,img,iso,m3u,mdf,mds,pbp,psexe,psf,toc",
      "_man_edit": false
   },
   "psp":{
      "_name": "psp",
      "_description": "Handheld game console developed and marketed by Sony Computer Entertainment. Is the first handheld installment in the PlayStation line of consoles. As a seventh generation console, the PSP competed with the Nintendo DS.",
      "_folder": "psp",
      "_full_name": "Sony PlayStation Portable",
      "_developer": "Sony Computer Entertainment",
      "_release": "25.08.2005",
      "_extensions": "cso,elf,iso,pbp,prx",
      "_man_edit": false
   },
   "megadrive":{
      "_name": "megadrive",
      "_description": "16-bit fourth-generation home video game console developed and sold by Sega. The Genesis was Sega's third console and the successor to the Master System. In 1990, it was distributed as the Mega Drive by Virgin Mastertronic in Europe, Ozisoft in Australasia, and Tec Toy in Brazil. In South Korea, it was distributed by Samsung as the Super Gam*Boy and later the Super Aladdin Boy. In Russia, it was distributed by Forrus.",
      "_folder": "megadrive",
      "_full_name": "Sega Mega Drive/Genesis",
      "_developer": "Sega",
      "_release": "01.09.1990",
      "_extensions": "32x,68k,bin,bms,chd,cue,gen,gg,iso,m3u,md,mdx,pco,sg,sgd,smd,sms",
      "_man_edit": false
   },
   "dreamcast":{
      "_name": "dreamcast",
      "_description": "Home video game console released by Sega. It was the first in the sixth generation of video game consoles, preceding Sony's PlayStation 2, Nintendo's GameCube, and Microsoft's Xbox. The Dreamcast was Sega's final home console, with its discontinuation in 2001 marking the end of the company's eighteen years in the console market.",
      "_folder": "dreamcast",
      "_full_name": "Sega Dreamcast",
      "_developer": "Sega",
      "_release": "14.10.1999",
      "_extensions": "7z,bin,cdi,chd,cue,dat,elf,gdi,iso,lst,m3u,zip",
      "_man_edit": false
   },
}